# Taps
tap "homebrew/bundle"
tap "dart-lang/dart"
tap "sass/sass"

# Brew
# - General
brew "git"
brew "gh"
brew "starship"
brew "wget"
brew "fd"
brew "fzf"

# - Development Tools
brew "bat"
brew "tldr"
brew "pnpm"
brew "nodenv"

# - Languages
brew "dart"
brew "go"
brew "sass/sass/sass"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# - Frameworks
brew "hugo"

# - Editors
brew "neovim"
