# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "jkfran/killport"

# Brew
# - General
brew "git"
brew "gh"
brew "zsh"
brew "zsh-autosuggestions"
brew "starship"
brew "wget"

# - Development Tools
brew "bat"
brew "tldr"

# - Language support
brew "node"
brew "nodenv"

# - Editors
brew "vim"
brew "neovim"
brew "pnpm"

# - Media
brew "webp"
brew "pngquant"
brew "svgo"
brew "ffmpeg"
brew "youtube-dl"

# - Misc
brew "dnsmasq"
brew "exiftool"
brew "imagemagick"
brew "redis"
brew "tree"
brew "jkfran/killport/killport"

# Cask
# - Security
cask "1password", args: { appdir: "~/Applications" }
cask "1password-cli", args: { appdir: "~/Applications" }

# - Communication
cask "discord", args: { appdir: "~/Applications" }
cask "skype", args: { appdir: "~/Applications" }
cask "whatsapp", args: { appdir: "~/Applications" }

# - Design
cask "adobe-creative-cloud", args: { appdir: "~/Applications" }
cask "figma-beta", args: { appdir: "~/Applications" }
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-mono-for-powerline"
cask "font-sf-pro"
cask "fontforge"
cask "sf-symbols", args: { appdir: "~/Applications" }
cask "imageoptim", args: { appdir: "~/Applications" }

# - Development
cask "orbstack"
cask "hammerspoon", args: { appdir: "~/Applications" }
cask "iterm2", args: { appdir: "~/Applications" }
cask "visual-studio-code", args: { appdir: "~/Applications" }
cask "postman"

# - MacOS Improvements
cask "appcleaner", args: { appdir: "~/Applications" }
cask "bartender", args: { appdir: "~/Applications" }
cask "hazel", args: { appdir: "~/Applications" }
cask "qlimagesize"
cask "raycast"

# - Misc Apps
cask "arc"
cask "cron"
cask "google-drive"
cask "notion", args: { appdir: "~/Applications" }
cask "philips-hue-sync"
cask "readdle-spark"