brew "act"
brew "bat"
brew "dnsmasq"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gum"
brew "imagemagick"
brew "neovim"
brew "nginx"
brew "pkgconf"
brew "nodenv"
brew "openssh"
brew "php"
brew "pnpm"
brew "starship"
brew "svgo"
brew "tlrc"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "arc"
cask "beekeeper-studio"
cask "cloudflare-warp"
cask "dbngin"
cask "discord"
cask "docker-desktop"
cask "elgato-camera-hub"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "google-drive"
cask "hammerspoon"
cask "hazel"
cask "imageoptim"
cask "mos"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "philips-hue-sync"
cask "phpstorm"
cask "postman"
cask "raycast"
cask "sf-symbols"
cask "steam"
cask "touchdesigner"
cask "trae"
cask "whatsapp"
