# Taps
tap "homebrew/cask-fonts"

# Cask
# - Security
cask "1password"
cask "1password-cli"
cask "cloudflare-warp"

# - Communcation
cask "discord"
cask "skype"
cask "whatsapp"

# - Design
cask "figma-beta"
cask "sf-symbols"
cask "imageoptim"
# -- Fonts
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-mono-for-powerline"
cask "font-sf-pro"

# - Development
cask "hammerspoon"
cask "ghostty"
cask "webstorm"
cask "postman"

# - MacOS Improvements
cask "appcleaner"
cask "bartender"
cask "hazel"
cask "raycast"
cask "mos"

# - General productivity
cask "arc"
cask "notion"
cask "notion-calendar"
cask "google-drive"
